[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:141:15
    */
   updatePlayerLocation(player: Player, location: UserLocation): void {
     const conversation = this.conversationAreas.find(
-      conv => conv.label === location.conversationLabel,
+      conv => false,
     );
     const prevConversation = player.activeConversationArea;
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "newConversationArea1 Label"
Received: undefined

[Killed] EqualityOperator
hw3-handout final/src/lib/CoveyTownController.ts:141:15
    */
   updatePlayerLocation(player: Player, location: UserLocation): void {
     const conversation = this.conversationAreas.find(
-      conv => conv.label === location.conversationLabel,
+      conv => conv.label !== location.conversationLabel,
     );
     const prevConversation = player.activeConversationArea;
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "newConversationArea1 Label"
Received: "label of the conversation area"

[Killed] EqualityOperator
hw3-handout final/src/lib/CoveyTownController.ts:148:9
     player.location = location;
     player.activeConversationArea = conversation;
 
-    if (conversation !== prevConversation) {
+    if (conversation === prevConversation) {
       if (prevConversation) {
         this.removePlayerFromConversationArea(player, prevConversation);
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Hog1fFnEqc452iTdcCw_f"
Received: undefined

[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:172:49
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea): void {
     conversation.occupantsByID.splice(
-      conversation.occupantsByID.findIndex(p => p === player.id),
+      conversation.occupantsByID.findIndex(p => false),
       1,
     );
killedBy: CoveyTownController updatePlayerLocation should check for the index mutation of the player when the player has been removed from the given index
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "ivPMIEobwfZ4q0t879mi8"
Received array: ["iioM1tBSI8-ENMDsXHe6W", "0nuhzH49ySa0HJeqbGNpO"]

[Killed] EqualityOperator
hw3-handout final/src/lib/CoveyTownController.ts:172:49
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea): void {
     conversation.occupantsByID.splice(
-      conversation.occupantsByID.findIndex(p => p === player.id),
+      conversation.occupantsByID.findIndex(p => p !== player.id),
       1,
     );
killedBy: CoveyTownController updatePlayerLocation should check for the index mutation of the player when the player has been removed from the given index
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "b4a_R6EsjdD_W9w6nx0XT"
Received array: ["2tdvNYHveRHd5vMMngcWR", "dRQhoBJHhtCWloSTgEze3"]

[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:175:9
       conversation.occupantsByID.findIndex(p => p === player.id),
       1,
     );
-    if (conversation.occupantsByID.length === 0) {
+    if (false) {
       this._conversationAreas.splice(
         this._conversationAreas.findIndex(conv => conv === conversation),
killedBy: CoveyTownController addConversationArea Represents the edge cases to be checked throughout the addConversation area function
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 4

[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:175:9
       conversation.occupantsByID.findIndex(p => p === player.id),
       1,
     );
-    if (conversation.occupantsByID.length === 0) {
+    if (true) {
       this._conversationAreas.splice(
         this._conversationAreas.findIndex(conv => conv === conversation),
killedBy: CoveyTownController addConversationArea Represents the adding of players and conversation areas that are invalid 
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 2

[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:201:7
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (
-      this._conversationAreas.find(
-        eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
-      )
+      false
     )
       return false;
killedBy: CoveyTownController addConversationArea Represents the checking of the label edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:201:7
    */
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (
-      this._conversationAreas.find(
-        eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
-      )
+      true
     )
       return false;
killedBy: CoveyTownController addConversationArea should add the conversation area to the list of conversation areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:202:37
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (
       this._conversationAreas.find(
-        eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+        eachExistingConversation => false,
       )
     )
killedBy: CoveyTownController addConversationArea Represents the checking of the label edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
hw3-handout final/src/lib/CoveyTownController.ts:202:37
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (
       this._conversationAreas.find(
-        eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+        eachExistingConversation => true,
       )
     )
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
hw3-handout final/src/lib/CoveyTownController.ts:205:14
         eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
       )
     )
-      return false;
+      return true;
     if (_conversationArea.topic === '') {
       return false;
killedBy: CoveyTownController addConversationArea Represents the checking of the label edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
hw3-handout final/src/lib/CoveyTownController.ts:222:49
     const newArea: ServerConversationArea = Object.assign(_conversationArea);
     this._conversationAreas.push(newArea);
     const playersInThisConversation = this.players.filter(player => player.isWithin(newArea));
-    playersInThisConversation.forEach(player => {
-      player.activeConversationArea = newArea;
-    });
+    playersInThisConversation.forEach(player => {});
     newArea.occupantsByID = playersInThisConversation.map(player => player.id);
     this._listeners.forEach(listener => listener.onConversationAreaUpdated(newArea));
killedBy: CoveyTownController addConversationArea Represents the checking of edge cases for the addConversationArea
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"boundingBox": {"height": 10, "width": 10, "x": 20, "y": 20}, "label": "invalidConversation", "occupantsByID": ["6gf22oK_FlEZ57uBe6SBm"], "topic": "invalid"}
Received: undefined
