[Killed] StringLiteral
hw3-handout final/src/requestHandlers/CoveyTownRequestHandlers.ts:189:43
   const townController = townsStore.getControllerForTown(_requestData.coveyTownID);
   if (!townController?.getSessionByToken(_requestData.sessionToken)){
     return {
-      isOK: false, response: {}, message: `Unable to create conversation area ${_requestData.conversationArea.label} with topic ${_requestData.conversationArea.topic}`,
+      isOK: false, response: {}, message: ``,
     };
   }
killedBy: conversationAreaCreateHandler Checks for a invalid session token before creating a conversation area
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "isOK": false,
-   "message": "Unable to create conversation area cXisRot_SoAzqfIYCkRvv with topic ijHGjxluvFQ6zgSm2uLP6",
