[Survived] ObjectLiteral
hw3-handout final/src/router/towns.ts:112:58
       res.status(StatusCodes.OK).json(result);
     } catch (err) {
       logError(err);
-      res.status(StatusCodes.INTERNAL_SERVER_ERROR).json({
-        message: 'Internal server error, please see log in server for more details',
-      });
+      res.status(StatusCodes.INTERNAL_SERVER_ERROR).json({});
     }
   });

[Survived] StringLiteral
hw3-handout final/src/router/towns.ts:113:18
     } catch (err) {
       logError(err);
       res.status(StatusCodes.INTERNAL_SERVER_ERROR).json({
-        message: 'Internal server error, please see log in server for more details',
+        message: "",
       });
     }

[Survived] ObjectLiteral
hw3-handout final/src/router/towns.ts:118:44
     }
   });
 
-  const socketServer = new io.Server(http, { cors: { origin: '*' } });
+  const socketServer = new io.Server(http, {});
   socketServer.on('connection', townSubscriptionHandler);
   return socketServer;
