[Killed] ArithmeticOperator
hw3-handout final/src/types/Player.ts:58:25
    */
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
-      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
+      this.location.x > conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hw3-handout final/src/types/Player.ts:58:7
    */
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
-      this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
-      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
-      this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
-      this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
+      true
     );
   }
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
hw3-handout final/src/types/Player.ts:59:7
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
-      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
+      this.location.x <= conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
hw3-handout final/src/types/Player.ts:59:25
   isWithin(conversation: ServerConversationArea) : boolean {
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
-      this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
+      this.location.x < conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
hw3-handout final/src/types/Player.ts:60:7
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
-      this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
+      true &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
     );
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
hw3-handout final/src/types/Player.ts:60:7
     return (
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
-      this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
+      this.location.y <= conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
       this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
     );
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
hw3-handout final/src/types/Player.ts:61:7
       this.location.x > conversation.boundingBox.x - conversation.boundingBox.width / 2 &&
       this.location.x < conversation.boundingBox.x + conversation.boundingBox.width / 2 &&
       this.location.y > conversation.boundingBox.y - conversation.boundingBox.height / 2 &&
-      this.location.y < conversation.boundingBox.y + conversation.boundingBox.height / 2
+      this.location.y >= conversation.boundingBox.y + conversation.boundingBox.height / 2
     );
   }
killedBy: CoveyTownController addConversationArea Represents the checking of the bounding boxes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
